Repository: davidhalasz/woofinder
Catalog: lib/l10n/app_*.arb
Languages: hu

source: Username
hu: Felhasználónév

source: Password
hu: Jelszó

# userNameError
source: Username must be at least 3 characters long!
hu: A felhasználónévnek legalább 3 karakterből kell állnia!

# passwordError
source: Password must be at least 7 characters long!
hu: A jelszónak legalább 7 karakter hosszúnak kell lennie!

# emailError
source: Please enter a valid email address.
hu: Nem megfelelő email cím.

source: Login
hu: Bejelentkezés

source: Sign up
hu: Regisztrálás

# createNewAcc
source: Create new account
hu: Új fiók létrehozása

# alreadyAnAcc
source: I already have an account
hu: Már van fiókom

# forgotPassword
source: Forgot your password?
hu: Elfelejtetted a jelszavad?

# usernameExists
source: Username already exists!
hu: Ez a felhasználónév már létezik!

# errorOccured
source: An error occured, please check your credentials
hu: Hiba történt! Ellenőrízd a megadott felhasználóneved és jelszavad!

# resetEmailMsg
source: Please check your email.
hu: Kérlek ellenőrízd az emailedet.

source: Send
hu: Küldés

source: Cancel
hu: Mégsem

# mainTitle
source: Discover
hu: Felfedezés

# postedSec
source: seconds ago
hu: másodperccel ezelőtt

# postedMin
source: minutes ago
hu: perccel ezelőtt

# postedHrs
source: hours ago
hu: órával ezelőtt

# postedDays
source: days ago
hu: nappal ezelőtt

source: BACK
hu: VISSZA

source: Comments
hu: Hozzászólások

# editBtn
source: Edit
hu: Szerkesztés

# deleteBtn
source: Delete
hu: Törlés

# writeComment
source: Write a comment
hu: Szólj hozzá

# editDescBtn
source: Edit description
hu: Leírás szerkesztése

# deleteCommentTxt
source: Are you sure want to delete this comment?
hu: Biztosan törölni szeretnéd a kommentet?

# errorOccuredTtitle
source: An error occured!
hu: Hiba történt!

# errorOccuredContent
source: Something went wrong! Try later.
hu: Valami nem működik. Próbáld meg később.

# successDel
source: Success!
hu: Sikeresen törölve!

# deleteAnimalContent
source: Are you sure want to delete it?
hu: Biztosan törölni szeretnéd?

source: The field cannot be empty!
hu: A mező üres!!

# addNewPostTitle
source: Add New Post
hu: Új poszt létrehozása

# addNewPostSubtitle
source: Did you see a lost animal or are you looking for your pet? Share it!
hu: Láttál egy elveszett álatot? Vagy keresed a saját kisállatod? Osszd meg a többiekkel!

# descHintText
source: Description about animal...
hu: Leírás az állatról...

source: No Image Selected
hu: Nincs kép kiválasztva

# choosePic
source: Choose pictures
hu: Képek kiválasztása

# noLocChosen
source: No Location Chosen
hu: Nincs hely megadva

# noLocError
source: Please add a location!
hu: Kérlek adj meg egy helyet!

# currentLoc
source: Use Current Location
hu: Jelenlegi helyzet

# seletOnMap
source: Select on map
hu: Kiválasztás a térképen

source: Settings
hu: Beállítások

source: Uploaded animals
hu: Feltöltött posztok

source: Your Account
hu: Fiókod

source: Delete account
hu: Fiók törlése

source: Logout
hu: Kijelentkezés

# sureDeleteAcc
source: Are you sure want to delete Your account?
hu: Biztosan törölni szeretnéd a fiókod?

# selectPlace
source: Select a place
hu: Kiválasztás a térképen

# moreInfo
source: More information
hu: Több információ

source: Found animals
hu: Talált állatok

# reportTitle
source: Report
hu: Jelentés

# reportContent
source: Are you sure you want to report this page?
hu: Biztos be szeretnéd jelenteni ezt az oldalt?

# reportScaffold
source: Thank you! We will check it in 24 hours.
hu: Köszönjük a visszajelzést! 24 órán belül átnézzük.

# reportSendBtn
source: SEND
hu: KÜLDÉS

# problemSolved
source: In good hands
hu: Jó kezekben van

source: Problem unsolved
hu: Probléma megoldatlan

# settingReport
source: Reports
hu: Bejelentések

source: Notification setting
hu: Értesítési beállítás

# notificationContent
source: Maximum distance to get notification from found animals
hu: Maximális értesítési távolság a talált állatokról

# descHint
source: Description about animal...
hu: Leírás az állatról...

# locationTxt
source: Location
hu: Helyzet

# someoneCommentedOnFollowedPost
source: Someone reacted to a post where you wrote a comment.
hu: Valaki reagált egy bejegyzésre, amihez korábban hosszászóltál.

# someoneCommentedOnOwnPost
source: Someone commented on your post.
hu: Valaki hozzászólt az egyik bejegyzésedhez.

# commentedOnFollowedPost
source: commented on a post you have wrote a comment before.
hu: reagált egy bejegyzésre, amihez korábban hosszászóltál.

# commentedOnOwnPost
source: commented on your post.
hu: hozzászólt az egyik bejegyzésedhez.

# foundNewAnimal
source: found an animal!
hu: talált egy állatot!

# accept1
source: By signing up, I agree to
hu: Elolvastam és elfogadom az

# accept2
source: Data Policy
hu: Adatvédelmi szabályzatot

# accept3
source: and the
hu: és a

# accept4
source: Terms
hu: Használati feltételeket

# acceptAge
source: I am older than 13 years old
hu: Kijelentem, hogy elmúltam 13 éves

# needAccept
source: You need to accept the terms and conditions.
hu: Nincsenek elfogadva a feltételek!

source: Terms
hu: Használati feltételek

source: Privacy Policy
hu: Adatvédelmi irányelvek

source: Pinned
hu: Kiemelt

# verEmail1
source: A verification email has been sent to your
hu: Egy megerősítő email el lett küldve a

source: address
hu: címre

# notification
source: Notifications
hu: Értesítések

# enableLocation
source: To display results near you, please enable
hu: A hozzád legközelebbi találatok megjelenítéshez engedélyezd a

# enableLocationLink
source: location tracking
hu: helymeghatározást

# enableCurrentLocation
source: Please enable
hu: Kérlek engedélyezd a
